app/controllers/items_controller.rb

  def create
    # add item(product) to cart
    product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 2)