app/controllers/products_controller.rb

SELECT * FROM "products" WHERE ("products"."id" = 1)
---
  def show
    @product = Product.find(params[:id])

SELECT * FROM "products" WHERE ("products"."id" = 1)
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO "products" ("image_url", "updated_at", "title", "price", "description", "created_at") VALUES('http://ecx.images-amazon.com/images/I/51cPj2IZv7L._BO2,204,203,200_PIsitb-sticker-arrow-click,TopRight,35,-76_AA240_SH20_OU01_.jpg', '2009-01-26 02:01:07', 'Daemon', 1779, 'Suarez''s riveting debut would be a perfect gift for a favorite computer geek or anyone who appreciates thrills, chills and cyber suspense. Gaming genius Matthew Sobol, the 34-year-old head of CyberStorm Entertainment, has just died of brain cancer, but death doesn''t stop him from initiating an all-out Internet war against humanity. When the authorities investigate Sobol''s mansion in Thousand Oaks, Calif., they find themselves under attack from his empty house, aided by an unmanned Hummer that tears into the cops with staggering ferocity. Sobol''s weapon is a daemon, a kind of computer process that not only has taken over many of the world''s computer systems but also enlists the help of superintelligent human henchmen willing to carry out his diabolical plan. Complicated jargon abounds, but most complexities are reasonably explained. A final twist that runs counter to expectations will leave readers anxiously awaiting the promised sequel.', '2009-01-26 02:01:07')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM "products" WHERE ("products"."id" = 1)
UPDATE "products" SET "title" = 'The Kite Runner', "image_url" = 'http://kiterunner.com', "description" = '...good movie... haven''t read the book', "updated_at" = '2009-01-26 07:34:01' WHERE "id" = 4
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT * FROM "products" WHERE ("products"."id" = 953125641)
DELETE FROM "products" WHERE "id" = 953125641
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy