app/controllers/store_controller.rb

  def index
    StoreUtil.find_cart(session[:cart])
    @products = Product.find_products_for_sale
---
SELECT * FROM "products" ORDER BY title